/******************************************************************

			主函数的各种功能函数
 
******************************************************************/

#include "head.h"
#include "SVGAmode.h"
#include "outtext.h"
#include "function.h"
#include "picture.h"


/*********
		登陆界面
**********/
void Login_pic(void)
{

	Bar64k(0,0,1023,767,2463);					//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	
	Outtext(390,77,"平安好医生",48,50,63488);	//输出项目标题
	Outtext(216,245,"用户名",48,50,2047);		
	Outtext(236,359,"密码",48,50,2047);
	Bar64k(388,230,881,297,65184);				
	Bar64k(388,344,881,415,65184);
	Bar64k(487,458,712,543,26592);
	Bar64k(322,618,512,672,63488);
	Bar64k(634,618,824,670,2016);
	LightBarWiden(385,227,884,300,0);
	LightBarWiden(385,341,884,418,0);
	LightBarWiden(484,455,715,546,0);
	LightBarWiden(319,615,515,675,0);
	LightBarWiden(631,615,827,673,0);
	Outtext(543,477,"登录",48,50,63488);
	Outtext(350,630,"忘记密码",32,35,2016);
	Outtext(695,630,"注册",32,35,57335);
}


/*********
		忘记密码界面
**********/
void Forget_user_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(400,77,"平安好医生",48,50,63488);
	Outtext(206,187,"用户名",32,35,2047);
	Outtext(185,273,"密保问题",32,35,2047);
	Outtext(185,359,"密保答案",32,35,2047);
	Outtext(206,445,"新密码",32,35,2047);
	Outtext(183,532,"确定密码",32,35,2047);
	Bar64k(422,659,604,720,65504);		//找回密码按钮
	Bar64k(440,183,710,226,65503);		//用户名框
	Bar64k(440,269,710,312,65503);		//密保问题框
	Outtext(440,269,"您的手机号为",32,35,0);	//密保问题
	Bar64k(440,355,710,398,65503);		//密保答案框
	Bar64k(440,441,710,484,65503);		//新密码框
	Bar64k(440,527,710,570,65503);		//确定密码框
	LightBarWiden(419,656,607,723,0);
	LightBarWiden(437,180,713,229,0);
	LightBarWiden(437,266,713,315,0);
	LightBarWiden(437,352,713,401,0);
	LightBarWiden(437,438,713,487,0);
	LightBarWiden(437,524,713,573,0);
	Outtext(443,672,"找回密码",32,35,63776);
}


/*********
		注册界面
**********/
void Register_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(400,77,"平安好医生",48,50,63488);
	Outtext(196,193,"用户名",32,35,2047);
	Outtext(210,273,"密码",32,35,2047);
	Outtext(174,350,"确定密码",32,35,2047);
	Outtext(174,428,"密保问题",32,35,2047);
	Outtext(174,507,"密保答案",32,35,2047);
	Bar64k(429,607,596,661,2016);				//注册按钮
	Outtext(480,617,"注册",32,35,63776);
	Bar64k(675,431,955,547,65184);				//提示底色
	Outtext(718,435,"请您牢记密",32,35,63776);
	Outtext(700,500,"保问题及答案",32,35,63776);
	Bar64k(356,193,637,228,65503);				//用户名框
	Bar64k(356,273,637,308,65503);				//密码框
	Bar64k(356,353,637,388,65503);				//确定密码框
	Bar64k(356,433,637,468,65503);				//密保问题框
	Outtext(361,438,"您的手机号为",32,35,2047);	//密保问题
	Bar64k(356,513,637,548,65503);				//密保答案框
	LightBarWiden(426,604,599,664,0);
	LightBarWiden(353,190,640,231,0);
	LightBarWiden(353,270,640,311,0);
	LightBarWiden(353,350,640,391,0);
	LightBarWiden(353,430,640,471,0);
	LightBarWiden(353,510,640,551,0);
}
	
/*********

		主界面
		
**********/
void Interface_pic(void)
{
    Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Bar64k(0,160,1023,360,26592);
	Bar64k(0,360,1023,610,64104);
	Bar64k(0,696,265,767,58891);
	Bar64k(265,696,512,767,20272);
	Bar64k(512,696,768,767,65504);
	Bar64k(768,696,1023,767,57344);
	
	
	Outtext(380,50,"平安好医生",48,50,63488);
	Outtext(59,184,"儿科",48,50,0);
	Outtext(335,184,"妇科",48,50,0);
	Outtext(564,184,"皮肤科",48,50,0);
	Outtext(842,184,"外科",48,50,0);
	Outtext(66,283,"骨科",48,50,0);
	Outtext(283,283,"耳鼻喉科",48,50,0);
	Outtext(564,283,"心理科",48,50,0);
	Outtext(845,283,"内科",48,50,0);
	
	
	Outtext(68,715,"首页",48,50,0);
	Outtext(314,715,"选医生",48,50,0);
	Outtext(592,715,"购药",48,50,0);
	Outtext(801,715,"个人中心",48,50,0);
	
	Circlefill64k(43,653,43,65503);
	Circlefill64k(129,653,43,65503);
	Circlefill64k(215,653,43,65503);
	Circlefill64k(301,653,43,65503);
	Circlefill64k(386,653,42,65503);
	Circlefill64k(470,653,42,65503);
	Circlefill64k(554,653,42,65503);
	Circlefill64k(638,653,42,65503);
	Circlefill64k(723,653,43,65503);
	Circlefill64k(809,653,43,65503);
	Circlefill64k(895,653,43,65503);
	Circlefill64k(981,653,43,65503);
	
	Capsule(31,616,12);
	Capsule(117,616,12);
	Capsule(203,616,12);
	Capsule(289,616,12);
	Capsule(374,616,12);
	Capsule(458,616,12);
	Capsule(542,616,12);
	Capsule(626,616,12);
	Capsule(711,616,12);
	Capsule(797,616,12);
	Capsule(883,616,12);
	Capsule(969,616,12);
	
	LightBarWiden(0,160,256,260,0);
	LightBarWiden(256,160,512,260,0);
	LightBarWiden(512,160,768,260,0);
	LightBarWiden(768,160,1023,260,0);
	LightBarWiden(0,260,256,360,0);
	LightBarWiden(256,260,512,360,0);
	LightBarWiden(512,260,768,360,0);
	LightBarWiden(768,260,1023,360,0);
	
	Outtext(447,361,"今日推送",32,36,0);
	Outtext(0,397,"黑米--补气养血，又叫月子米、补血米，特别适用产妇和老年人;木耳--常吃降三",24,27,0);
	Outtext(0,424,"高，能强身抗癌清肠道，木耳不仅驻颜养颜、美白补血，而且对心脏也有好处，预防动",24,27,0);
	Outtext(0,451,"脉粥样硬化;乌鸡--对老年人骨质疏松、防止小孩佝偻病及缺铁性贫血等疾病都有上",24,27,0);
	Outtext(0,478,"佳疗效。第一菜：莲藕，养阴清热、润燥止渴;第一坚果：花生，醒脾和胃、润肺化痰",24,27,0);
	Outtext(0,505,"第一补：山药，利于脾胃消化吸收;第一饮：黄酒，温脾胃、润皮肤;第一肉：墨鱼，",24,27,0);
	Outtext(0,532,"高蛋白低脂肪;第一水果：梨，生津润肺;第一粥：百合粥，清心安神。小米益肾安神",24,27,0);
	Outtext(0,559,"健胃;荞麦开胃宽肠、清热解毒;糙米帮助消化;芡实补脾益肾、镇痛止泻;黄豆健脾",24,27,0);
	Outtext(0,587,"润燥;黑豆明目补肾养血。",24,27,0);
	/*Outtext(0,579,"番茄把火压，鲜食葡萄保容颜，白萝卜来把肺清，秋藕来把秋燥除，人见人爱胡萝卜。",24,27,0);*/
	
	
	

}


/********

管理员密码输入界面

********/
void Adminpass_pic(void)
{
	Bar64k(207,162,807,548,26592);						//背景框
	Outtext(258,234,"请输入管理员密码",48,50,415);		//文字
	Bar64k(308,355,715,431,65503);						//输入框
	LightBarWiden(207,162,807,548,63503);				//红色边框
	
	Bar64k(761,162,807,208,55463);		
	Line64k(761,162,807,208,65504);
	Line64k(761,208,807,162,65504);			//退出按钮
}


/*********

		找医生界面
		
**********/
void SelectDoc_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(423,14,"找医生",48,50,2016);	//界面标题
	
	Bar64k(0,0,242,50,800);
	Outtext(0,0,"按从医年数排序",32,35,63488);
	Bar64k(0,50,120,87,61460);
	Outtext(20,53,"降序",24,26,0);
	Bar64k(122,50,242,87,2016);
	Outtext(144,53,"升序",24,26,63488);
	
	Pageup(21,659,26592);
	Pagedown(942,659,26592);
	
	//画底部框
	Bar64k(0,696,265,767,58891);
	Bar64k(265,696,512,767,20272);
	Bar64k(512,696,768,767,65504);
	Bar64k(768,696,1023,767,57344);
	
	Outtext(68,715,"首页",48,50,0);
	Outtext(314,715,"选医生",48,50,0);
	Outtext(592,715,"购药",48,50,0);
	Outtext(801,715,"个人中心",48,50,0);
}

//医生信息框的背景
void Doc_backpic(void)
{
	Bar64k(0,88,1024,269,2032);				//第一个医生的信息底框
	Bar64k(0,277,1024,458,2032);			//第二个医生的信息底框
	Bar64k(0,466,1024,647,2032);			//第三个医生的信息底框
	
	Bar64k(0,269,1024,277,65504);			//医生分割线
	Bar64k(0,458,1024,466,65504);			//医生分割线
	Bar64k(507,88,517,647,61460);			//医生分割线
	
	//医生名字底框
	Bar64k(0,96,108,136,53216);
	Bar64k(0,285,108,327,53216);
	Bar64k(0,474,108,516,53216);
	Bar64k(517,96,625,136,53216);
	Bar64k(517,286,625,327,53216);
	Bar64k(517,474,625,516,53216);
	
	
	
	
	//问诊图标
	Ask_ico(0,88);
	Ask_ico(0,283);
	Ask_ico(0,472);
	Ask_ico(517,88);
	Ask_ico(517,283);
	Ask_ico(517,472);
	LightCirWiden(470,174,36,0);
	LightCirWiden(470,367,36,0);
	LightCirWiden(470,556,36,0);
	LightCirWiden(987,174,36,0);
	LightCirWiden(987,367,36,0);
	LightCirWiden(987,556,36,0);
}


/*********

		管理员界面
		
**********/
void Admin_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(366,14,"医生信息管理",48,50,2016);		//界面标题
	
	Bar64k(296,222,842,314,26592);
	Bar64k(296,454,842,546,26592);
	
	Outtext(322,247,"用户密保查看与修改",48,50,0);
	Outtext(364,478,"医生数量删减",48,50,0);
}
	
	
/*********

        购药界面
	
*********/	
void Buymedicine_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮

    Outtext(500,14,"购药",48,50,2016);      //界面标题

    Bar64k(0,88,1024,649,2032);
    Line64k(0,273,1024,273,0);
	Line64k(0,462,1024,462,0);
	Line64k(256,88,256,647,0);
	Line64k(512,88,512,647,0);
	Line64k(768,88,768,647,0);
	
	//购买框
	Outtext(201,243,"购买",24,25,64104);
	Outtext(457,243,"购买",24,25,64104);
	Outtext(713,243,"购买",24,25,64104);
	Outtext(969,243,"购买",24,25,64104);
	Outtext(201,432,"购买",24,25,64104);
	Outtext(457,432,"购买",24,25,64104);
	Outtext(713,432,"购买",24,25,64104);
	Outtext(969,432,"购买",24,25,64104);
	Outtext(201,621,"购买",24,25,64104);
	Outtext(457,621,"购买",24,25,64104);
	Outtext(713,621,"购买",24,25,64104);
	Outtext(969,621,"购买",24,25,64104);
		
	//购买框加粗
	LightBarWiden(186,233,255,272,0);
	LightBarWiden(442,233,511,272,0);
	LightBarWiden(698,233,767,272,0);
	LightBarWiden(954,233,1023,272,0);
	LightBarWiden(186,422,255,461,0);
	LightBarWiden(442,422,511,461,0);
	LightBarWiden(698,422,767,461,0);
	LightBarWiden(954,422,1023,461,0);
	LightBarWiden(186,611,255,650,0);
	LightBarWiden(442,611,511,650,0);
	LightBarWiden(698,611,767,650,0);
	LightBarWiden(954,611,1023,650,0);
	
	//详情框
	Outtext(201,203,"详情",24,25,64104);
	Outtext(457,203,"详情",24,25,64104);
	Outtext(713,203,"详情",24,25,64104);
	Outtext(969,203,"详情",24,25,64104);
	Outtext(201,392,"详情",24,25,64104);
	Outtext(457,392,"详情",24,25,64104);
	Outtext(713,392,"详情",24,25,64104);
	Outtext(969,392,"详情",24,25,64104);
	Outtext(201,581,"详情",24,25,64104);
	Outtext(457,581,"详情",24,25,64104);
	Outtext(713,581,"详情",24,25,64104);
	Outtext(969,581,"详情",24,25,64104);
	
	//详情框加粗
	LightBarWiden(186,194,255,233,0);
	LightBarWiden(442,194,511,233,0);
	LightBarWiden(698,194,767,233,0);
	LightBarWiden(954,194,1023,233,0);
	LightBarWiden(186,383,255,422,0);
	LightBarWiden(442,383,511,422,0);
	LightBarWiden(698,383,767,422,0);
	LightBarWiden(954,383,1023,422,0);
	LightBarWiden(186,572,255,611,0);
	LightBarWiden(442,572,511,611,0);
	LightBarWiden(698,572,767,611,0);
	LightBarWiden(954,572,1023,611,0);

	
	//药品名称价格
	Bar64k(1,89,255,108,53216);
	Bar64k(257,89,511,108,53216);
	Bar64k(513,89,767,108,53216);
	Bar64k(769,89,1023,108,53216);
	Bar64k(1,274,255,293,53216);
	Bar64k(257,274,511,293,53216);
	Bar64k(513,274,767,293,53216);
	Bar64k(769,274,1023,293,53216);
	Bar64k(1,463,255,482,53216);
	Bar64k(257,463,511,482,53216);
	Bar64k(513,463,767,482,53216);
	Bar64k(769,463,1023,482,53216);
	
	//画底部框
	Bar64k(0,696,265,767,58891);
	Bar64k(265,696,512,767,20272);
	Bar64k(512,696,768,767,65504);
	Bar64k(768,696,1023,767,57344);
	
	//画药瓶
	Medicinebot(70,135,15);
	Medicinebot(326,135,15);
	Medicinebot(582,135,15);
	Medicinebot(838,135,15);
	Medicinebot(70,320,15);
	Medicinebot(326,320,15);
	Medicinebot(582,320,15);
	Medicinebot(838,320,15);
	Medicinebot(70,509,15);
	Medicinebot(326,509,15);
	Medicinebot(582,509,15);
	Medicinebot(838,509,15);
	
	Pageup(21,663,57344);
	Pagedown(942,663,57344);
	
	Outtext(68,715,"首页",48,50,0);
	Outtext(314,715,"选医生",48,50,0);
	Outtext(592,715,"购药",48,50,0);
	Outtext(801,715,"个人中心",48,50,0);
	
	
}
	
	
	
/***个人中心***/
void Personal_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮

    Outtext(379,7,"个人中心",48,50,2016);      //界面标题
	
	Circlefill64k(143,232,100,65504);
	Circlefill64k(106,195,20,65530);
	Circlefill64k(183,195,20,65530);
	Bar64k(91,264,195,288,26592);				//画人头
	
	Bar64k(326,185,736,276,2016);
	Outtext(350,208,"你好，",32,35,0);			//当前用户名显示
	
	Bar64k(0,409,256,501,26592);
	Outtext(27,430,"已购药物",48,50,0);
	Bar64k(258,409,514,501,34847);
	Outtext(294,429,"用户余额",48,50,0);
	Bar64k(516,409,772,501,53216);
	Outtext(553,429,"用户充值",48,50,0);
	Bar64k(774,409,1023,501,57344);
	Outtext(808,428,"修改密码",48,50,0);
	
	Outtext(441,517,"版本号:1.0",24,26,0);
	
	Bar64k(335,569,695,625,2016);
	Outtext(370,580,"ABOUT    US",24,26,0);
	
	//画底部框
	Bar64k(0,696,265,767,58891);
	Bar64k(265,696,512,767,20272);
	Bar64k(512,696,768,767,65504);
	Bar64k(768,696,1023,767,57344);
	
	Outtext(68,715,"首页",48,50,0);
	Outtext(314,715,"选医生",48,50,0);
	Outtext(592,715,"购药",48,50,0);
	Outtext(801,715,"个人中心",48,50,0);
}

/***已购药物界面***/

void Bought_pic(void)
{
	int i;
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(379,11,"已购药物",48,50,63503);
	
	for(i=0; i<8; i++)
	{
		Bar64k(0,101+72*i,1023,161+72*i,2016);
	}
	Bar64k(494,101,506,664,57638);
	Bar64k(775,101,787,664,32784);
	
	Outtext(163,107,"药品名",48,50,0);
	Outtext(590,107,"数量",48,50,0);
	Outtext(858,107,"费用",48,50,0);
	
	Pageup(21,730,26592);
	Pagedown(942,730,26592);		//画翻页按钮
}


/***修改密码界面***/	
void Change_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(308,7,"修改密码",48,50,63503);
	
	Outtext(157,172,"原密码",32,34,57344);
	Outtext(157,263,"新密码",32,34,57344);
	Outtext(133,354,"再次输入",32,34,57344);
	Bar64k(343,165,759,230,65535);
	Bar64k(343,260,759,325,65535);
	Bar64k(343,355,759,420,65535);
	
	Bar64k(334,539,695,628,2016);
	Outtext(411,557,"修改密码",32,35,0);
}
	
/***充值界面***/
void Charge_pic(void)
{
	Bar64k(157,130,866,615,2016);		//背景框
	
	Bar64k(812,130,866,186,63503);
	Line64k(812,130,866,186,65504);
	Line64k(812,186,866,130,65504);		//退出按钮
	
	LightBarWiden(157,130,866,615,0);
	Outtext(213,187,"充值金额",48,50,34847);
	Bar64k(457,181,777,246,65503);
	Bar64k(543,262,691,335,63503);
	Outtext(563,273,"充值",48,50,0);
}
	
/***关于我们界面***/
void About_pic(void)
{
	Bar64k(146,180,878,554,9284);	//背景
	LightBarWiden(144,178,880,556,65465);
	
	Bar64k(827,180,878,231,57344);
	Line64k(827,180,878,231,64518);
	Line64k(827,231,878,180,64518);		//退出
	
	Outtext(210,350,"自动化1701",32,35,0);
	Outtext(210,400,"蒋慧奇",32,35,0);
	Outtext(210,440,"孙闽俊",32,35,0);
}


/***购药窗口图片***/
void BuyM_pic(Medicine *medicine)
{
	Bar64k(146,180,878,554,9284);	//背景
	LightBarWiden(144,178,880,556,65465);
	
	Bar64k(827,180,878,231,57344);
	Line64k(827,180,878,231,64518);
	Line64k(827,231,878,180,64518);		//退出
	
	Outtext(161,205,"药名：",48,50,63503);
	Outtext(161,275,"单价：",48,50,63503);
	Outtext(659,345,"总价",48,50,63503);
	Outtext(186,343,"请输入购买数量",32,35,0);
	
	Bar64k(296,210,792,252,26620);		//药名
	Bar64k(296,279,792,321,65504);		//单价
	Bar64k(578,408,828,458,26620);		//总价
	Outtext(296,210,medicine->name,32,35,0);
	Outtext(296,279,medicine->price,32,35,0);
	
	Bar64k(285,405,380,461,65535);		//数量
	Bar64k(188,405,285,461,63503);		//减号
	Outtext(199,405,"-",48,50,0);
	Bar64k(380,405,480,461,63503);		//加号
	Outtext(400,405,"+",48,50,0);
	Outtext(302,405,"0",48,50,0);
	LightBarWiden(186,403,482,463,2016);
	Bar64k(455,483,578,543,62480);		//购买
	Outtext(470,490,"购买",48,50,62488);
}
	
/***问诊界面***/
void Ask_pic(Doctor *doc)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	//医生信息
	Outtext(420,13,doc->name,48,50,63503);
	Outtext(470,79,doc->department,32,35,2016);
	//医生和用户头像
	Circlefill64k(60,200,60,63503);
	Circlefill64k(961,350,63,63503);
	Outtext(14,181,"医生",48,50,26620);
	Outtext(918,325,"自己",48,50,26620);
	
	Bar64k(121,210,814,325,64704);		//医生对话框
	Outtext(164,218,"您好，很高兴为您提供问诊服务！",32,35,0);
	Outtext(163,270,"请您在下列选项中选择出您的病症。",32,35,0);
	Bar64k(277,350,896,437,65269);		//用户对话框
	//选择栏
	Bar64k(0,469,256,569,26620);		//第一个选择框
	Bar64k(256,469,512,569,34847);		//第二个选择框
	Bar64k(512,469,768,569,64704);		//第三个选择框
	Bar64k(768,469,1023,569,2016);		//第四个选择框
	Bar64k(0,569,256,669,2016);			//第五个选择框
	Bar64k(256,569,512,669,64704);		//第六个选择框
	Bar64k(512,569,768,669,26620);		//第七个选择框
	Bar64k(768,569,1023,669,34847);		//第八个选择框
	
	//结束问诊按钮
	Bar64k(301,685,723,754,65269);
	Outtext(425,697,"结束问诊",48,50,63503);
}

/***处方界面***/
void Chufang_pic(Doctor *doc,Resu res,int j,int b)
{
		Bar64k(0,0,1023,768,26620);
		Outtext(400,23,"处方",48,50,0);
		Outtext(200,80,doc->name,48,50,0);
			if(j==1)									//点击了37~38
			{
				if(b==1)
				{
					Outtext(130,215,(&res)->res1,32,35,0);
					Outtext(130,260,(&res)->res2,32,35,0);
				}
				else if(b==2)
				{
					Outtext(130,215,(&res)->res3,32,35,0);
					Outtext(130,260,(&res)->res4,32,35,0);
				}
				else if(b==3)
				{
					Outtext(130,215,(&res)->res5,32,35,0);
					Outtext(130,260,(&res)->res6,32,35,0);
				}
				else if(b==4)
				{
					Outtext(130,215,(&res)->res7,32,35,0);
					Outtext(130,260,(&res)->res8,32,35,0);
				}
			}
			if(j==2)									//点击了38~39
			{
				if(b==1 || b==2)
				{
					Outtext(130,215,(&res)->res9,32,35,0);
					Outtext(130,260,(&res)->res10,32,35,0);
				}
				else if(b==3 || b==4)
				{
					Outtext(130,215,(&res)->res11,32,35,0);
					Outtext(130,260,(&res)->res12,32,35,0);
				}
			}
			if(j==3 || j==4)									//点击了39~40或40+
			{
					Outtext(130,215,(&res)->res13,32,35,0);
					Outtext(130,260,(&res)->res14,32,35,0);
					delay(1000);
					Bar64k(121,210,814,325,64704);					//医生对话框
					Outtext(130,215,(&res)->res15,32,35,0);
					Outtext(130,260,(&res)->res16,32,35,0);
			}
}

/***结束问诊界面***/
void OverAsk_pic(void)
{
		Bar64k(167,171,857,629,26620);
		LightBarWiden(167,171,857,629,0);
		Outtext(283,224,"谢谢您的问诊，希望",48,50,0);
		Outtext(281,281,"您能感到满意！",48,50,0);
		Outtext(354,402,"祝您早日康复！",48,50,0);
		Outtext(453,514,"拜拜！",48,50,0);
}

/***儿科问诊症状***/
void erke_pic(void)
{
	Outtext(80,501,"发烧",32,35,0);
	Outtext(345,501,"感冒",32,35,0);
	Outtext(586,501,"拉肚子",32,35,0);
	Outtext(868,501,"生长迟缓",32,35,0);
}


	
/***妇科问诊症状***/
void fuke_pic(void)
{
	Outtext(50,501,"人工流产",32,35,0);
	Outtext(315,501,"不孕不育",32,35,0);
	Outtext(586,501,"月经不调",32,35,0);
	Outtext(838,501,"白带异常",32,35,0);
}

/***皮肤科症状***/
void skin_pic(void)
{
	Outtext(80,501,"雀斑",32,35,0);
	Outtext(345,501,"水痘",32,35,0);
	Outtext(586,501,"青春痘",32,35,0);
	Outtext(868,501,"牛皮癣",32,35,0);
}

/***骨科症状***/
void bone_pic(void)
{
	Outtext(80,501,"骨折",32,35,0);
	Outtext(345,501,"腰痛",32,35,0);
	Outtext(586,501,"关节炎",32,35,0);
	Outtext(868,501,"骨质疏松",32,35,0);
}

/***耳鼻喉科症状***/
void erbihou_pic(void)
{
	Outtext(80,501,"慢性鼻炎",32,35,0);
	Outtext(325,501,"鼻窦炎",32,35,0);
	Outtext(586,501,"喉炎",32,35,0);
	Outtext(868,501,"中耳炎",32,35,0);
}
	
/***心理科症状***/
void xinli_pic(void)
{
	Outtext(80,501,"频繁郁闷",32,35,0);
	Outtext(315,501,"感到寂寞",32,35,0);
	Outtext(586,501,"堕落",32,35,0);
	Outtext(868,501,"心理变态",32,35,0);
}

/***普内科症状***/
void neike_pic(void)
{
	Outtext(80,501,"头疼",32,35,0);
	Outtext(345,501,"胃不舒服",32,35,0);
	Outtext(586,501,"贫血",32,35,0);
	Outtext(868,501,"皮肤过敏",32,35,0);
}

/***普wai科症状***/
void waike_pic(void)
{
	Outtext(80,501,"前列腺炎",32,35,0);
	Outtext(345,501,"脓肿",32,35,0);
	Outtext(586,501,"痔疮",32,35,0);
	Outtext(868,501,"肛裂",32,35,0);
}

/***管理员修改密保界面***/
void Changeanswer_pic(void)
{

	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(379,11,"用户信息",48,50,63503);
	
	/*for(i=0; i<8; i++)
	{
		Bar64k(0,101+72*i,1023,161+72*i,2016);
	}
	for(i=1;i<8;i++)
	{
		Outtext(900,106+72*i,"修改",48,50,64264);
		LightBarWiden(900,101+72*i,1000,160+72*i,0);
	}
	Bar64k(294,101,306,664,57638);
	Bar64k(575,101,587,664,32784);
	
	Outtext(63,107,"用户名",48,50,0);
	Outtext(350,107,"密码",48,50,0);
	Outtext(658,107,"密保答案",48,50,0);*/
	
	
	Pageup(21,730,26592);
	Pagedown(942,730,26592);		//画翻页按钮
}
	
/***修改密保界面函数***/
void Alternum_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Bar64k(350,200,900,250,26592);
	Bar64k(350,350,900,400,26592);
	Bar64k(350,500,900,550,26592);
	Bar64k(440,582,584,668,26592);
	
	Outtext(366,14,"密保答案修改",48,50,2016);		//界面标题
	Outtext(464,600,"确定",48,50,63488);
	Outtext(100,200,"原答案",48,50,0);
	Outtext(100,350,"新答案",48,50,0);
	Outtext(52,500,"确认新答案",48,50,0);
	
	LightBarWiden(350,200,900,250,0);
	LightBarWiden(350,350,900,400,0);
	LightBarWiden(350,500,900,550,0);
	LightBarWiden(440,582,584,668,0);
}

/***管理员删减医生界面***/
void Deletedoc_bpic(void)
{
	Bar64k(0,88,1024,269,2032);				//第一个医生的信息底框
	Bar64k(0,277,1024,458,2032);			//第二个医生的信息底框
	Bar64k(0,466,1024,647,2032);			//第三个医生的信息底框
	
	Bar64k(0,269,1024,277,65504);			//医生分割线
	Bar64k(0,458,1024,466,65504);			//医生分割线
	Bar64k(507,88,517,647,61460);			//医生分割线
	
	//医生名字底框
	Bar64k(0,96,108,136,53216);
	Bar64k(0,285,108,327,53216);
	Bar64k(0,474,108,516,53216);
	Bar64k(517,96,625,136,53216);
	Bar64k(517,286,625,327,53216);
	Bar64k(517,474,625,516,53216);	
		
	Bar64k(455,90,505,140,55463);		
	Line64k(455,90,505,140,65504);
	Line64k(455,140,505,90,65504);	        //删除键
	
	Bar64k(455,279,505,329,55463);		
	Line64k(455,279,505,329,65504);
	Line64k(455,329,505,279,65504);	        //删除键

	Bar64k(455,468,505,518,55463);		
	Line64k(455,468,505,518,65504);
	Line64k(455,518,505,468,65504);	        //删除键	
	
	Bar64k(973,90,1023,140,55463);		
	Line64k(973,90,1023,140,65504);
	Line64k(973,140,1023,90,65504);	        //删除键	
	
	Bar64k(973,279,1023,329,55463);		
	Line64k(973,279,1023,329,65504);
	Line64k(973,329,1023,279,65504);	    //删除键		
	
	Bar64k(973,468,1023,518,55463);		
	Line64k(973,468,1023,518,65504);
	Line64k(973,518,1023,468,65504);	        //删除键		
}	
	
/*********

		删减医生界面
		
**********/
void Deldoc_pic(void)
{
	Bar64k(0,0,1023,767,2463);		//画蓝色背景
	
	Bar64k(978,0,1024,46,55463);		
	Line64k(978,0,1024,46,65504);
	Line64k(978,46,1024,0,65504);			//退出按钮
	
	Outtext(423,14,"删减医生",48,50,2016);	//界面标题
	
	
	
	Pageup(21,659,26592);
	Pagedown(942,659,26592);
	

	
}		
	
	
	
	
	
	
	
	
	
	
	
	
	